back-end/black-jack/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bobby Cannavale"], ["created_at", "2019-08-22 01:35:13.064137"], ["updated_at", "2019-08-22 01:35:13.064137"]]
---
  def create
      @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "money" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["money", -1245], ["updated_at", "2019-08-22 18:10:30.209606"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)